<?php

use yii\helpers\Html;


/* @var $this yii\web\View */
/* @var $info string */
/* @var $model \app\models\Fs */

$this->title = 'Создание архива';
if ($error) {
    ?>
      ERROR!!!!!
    <?php
} else {
?>

<div class="well wrap-create-archive">
    <div class="dl-info"><?= $info ?></div>
    <p class="text-archive">Один момент... Архивирую файлы</p>
</div>

<?php

$this->registerJs("
var dlintrvl = setInterval(function(){
  $.get(document.location.href, function(data){
    if (data.complete){
      clearInterval(dlintrvl);
      $('.wrap-create-archive').children('.dl-info').html('<svg id=\"SvgjsSvg1011\" xmlns=\"http://www.w3.org/2000/svg\" version=\"1.1\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:svgjs=\"http://svgjs.com/svgjs\" width=\"47\" height=\"47\"><defs id=\"SvgjsDefs1012\"></defs><path id=\"SvgjsPath1013\" d=\"M737.77 395.52L735.879 397.37C735.889 397.47 735.899 397.57 735.919 397.67C735.949 397.94 735.989 398.21000000000004 735.989 398.5C735.989 410.35 726.345 420 714.49 420C702.635 420 692.991 410.35 692.991 398.5C692.991 386.64 702.635 377 714.49 377C719.472 377 724.174 378.72 728.105 381.98L729.596 380.53000000000003C725.354 376.96000000000004 720.0120000000001 375.00000000000006 714.49 375.00000000000006C701.535 375.00000000000006 691 385.5400000000001 691 398.50000000000006C691 411.45000000000005 701.535 422.00000000000006 714.49 422.00000000000006C727.445 422.00000000000006 737.98 411.45000000000005 737.98 398.50000000000006C737.98 397.55000000000007 737.91 396.57000000000005 737.77 395.52000000000004ZM738 384.97C738 385.23 737.89 385.48 737.709 385.66L716.721 406.54C716.681 406.59000000000003 716.651 406.64000000000004 716.631 406.69C716.461 406.83 716.241 406.92 715.951 406.9C715.7810000000001 406.90999999999997 715.511 406.87 715.2900000000001 406.69L715.2600000000001 406.57L706.2970000000001 397.65999999999997C706.1070000000001 397.46999999999997 706.0070000000002 397.22999999999996 706.0070000000002 396.96999999999997C706.0070000000002 396.71 706.1070000000002 396.46 706.2970000000001 396.28C706.6770000000001 395.89 707.3070000000001 395.89 707.6870000000001 396.28L715.9610000000001 404.5L736.2990000000001 384.27C736.6890000000001 383.89 737.3190000000001 383.89 737.7090000000001 384.27C737.8900000000001 384.46 738.0000000000001 384.71 738.0000000000001 384.96999999999997Z \" fill=\"#1bcc6e\" transform=\"matrix(1,0,0,1,-691,-375)\"></path></svg>');
      $('.wrap-create-archive').children('.text-archive').html('Готово! Загружаю архив на ваше устройство');
      document.location.reload();
    } else {
      if (data.error){
        clearInterval(dlintrvl);
        $('.wrap-create-archive').children('.dl-info').html('<img src=\"/img/archive-error.svg\" class=\"archive-error\">');
        $('.wrap-create-archive').children('.text-archive').html('Ошибка! Попробуйте <a href=\"#\">создать архив еще раз</a>');
      } else {
          $('.dl-info').html(data.info);
      }
    }
  }, 'json');
}, 3000);
");

}
